{
  "architectures": [
    "DeepseekV3ForCausalLM"
  ],
  "model_type": "deepseek_v3",
  "hidden_size": 3584,
  "num_hidden_layers": 32,
  "num_attention_heads": 28,
  "num_key_value_heads": 28,
  "qk_nope_head_dim": 128,
  "qk_rope_head_dim": 0,
  "v_head_dim": 128,
  "intermediate_size": 9600,
  "moe_intermediate_size": 9600,
  "n_routed_experts": 4,
  "num_experts_per_tok": 4,
  "n_shared_experts": 1,
  "first_k_dense_replace": 3,
  "moe_layer_freq": 1,
  "q_lora_rank": 3584,
  "kv_lora_rank": 3584,
  "vocab_size": 50000,
  "max_position_embeddings": 4096,
  "attention_dropout": 0.0,
  "rms_norm_eps": 1e-06,
  "torch_dtype": "bfloat16",
  "tie_word_embeddings": false,
  "attention_bias": false
}